In [1]:
import ibm_db

In [3]:
# Identify the Database connection credentials

dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"
dsn_hostname = "dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net"
dsn_port = "50000"
dsn_protocol = "TCPIP"
dsn_uid = "mwk25315"
dsn_pwd = "rxn2vjqtsr3x7p+k"

In [6]:
# Create the database connection

dsn =(
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

print(dsn)

DRIVER={IBM DB2 ODBC DRIVER};DATABASE=BLUDB;HOSTNAME=dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net;PORT=50000;PROTOCOL=TCPIP;UID=mwk25315;PWD=rxn2vjqtsr3x7p+k;

In [9]:
try:
    conn = ibm_db.connect(dsn, "", "")
    print("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)
    
except:
    print("Unable to connect: ", ibm_db.conn_errormsg())

Connected to database:  BLUDB as user:  mwk25315 on host:  dashdb-txn-sbox-yp-dal09-14.services.dal.bluemix.net

### Create a table in the database

In [44]:
# Lets first drop the table INSTRUCTOR in case it exists from a previous attempt

dropQuery = "drop table INSTRUCTOR"

dropstmt = ibm_db.exec_immediate(conn, dropQuery)

In [45]:
createtbl = "Create table INSTRUCTOR (ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2))"

createstmt = ibm_db.exec_immediate(conn, createtbl)

### Insert data into the table

In [46]:
insertquery = "Insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA'), (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')"

insertstmt = ibm_db.exec_immediate(conn, insertquery)

### Query data in the table

In [47]:
selectquery = "select * from INSTRUCTOR"

selectstmt = ibm_db.exec_immediate(conn, selectquery)

# Fetch the Dictionary (for the first row only)
ibm_db.fetch_both(selectstmt)

{'ID': 1,
 0: 1,
 'FNAME': 'Rav',
 1: 'Rav',
 'LNAME': 'Ahuja',
 2: 'Ahuja',
 'CITY': 'TORONTO',
 3: 'TORONTO',
 'CCODE': 'CA',
 4: 'CA'}

In [48]:
while ibm_db.fetch_row(selectstmt) != False:
    print (" ID:",  ibm_db.result(selectstmt, 0), " FNAME:",  ibm_db.result(selectstmt, 1))

 ID: 2  FNAME: Raul
 ID: 3  FNAME: Hima

In [49]:
updatequery = "update INSTRUCTOR set CITY = 'Moosetown' where FNAME= 'Rav'"

updatestmt = ibm_db.exec_immediate(conn, updatequery)

In [50]:
selectquery = "select * from INSTRUCTOR"

selectstmt = ibm_db.exec_immediate(conn, selectquery)

while ibm_db.fetch_row(selectstmt) != False:
    print(ibm_db.result(selectstmt, 0), ibm_db.result(selectstmt, 1), ibm_db.result(selectstmt, 2), ibm_db.result(selectstmt, 3) )

1 Rav Ahuja Moosetown
2 Raul Chong Markham
3 Hima Vasudevan Chicago

### Retrieve Data into Pandas

In [51]:
import pandas
import ibm_db_dbi

In [53]:
pconn = ibm_db_dbi.Connection(conn)
pconn

In [54]:
selectquery = "Select * from INSTRUCTOR"

pdf = pandas.read_sql(selectquery, pconn)
pdf

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  Moosetown    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [55]:
pdf.LNAME[0]

'Ahuja'

In [56]:
pdf.shape

(3, 5)

### Close the Connection

In [57]:
ibm_db.close(conn)

True